Autodesk.Revit.DB.Structure.RebarCoverType.Create(Autodesk.Revit.DB.Document,System.String,System.Double)
Creates a new CoverType in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
coverDistance cannot be negative.